Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
d"
              + type = "string"
            }
          + columns {
              + name = "biosamplestatus"
              + type = "string"
            }
          + columns {
              + name = "collectiondate"
              + type = "string"
            }
          + columns {
              + name = "collectionmoment"
              + type = "string"
            }
          + columns {
              + name = "diagnosticmarkers"
              + type = "string"
            }
          + columns {
              + name = "histologicaldiagnosis"
              + type = "string"
            }
          + columns {
              + name = "measurements"
              + type = "string"
            }
          + columns {
              + name = "obtentionprocedure"
              + type = "string"
            }
          + columns {
              + name = "pathologicalstage"
              + type = "string"
            }
          + columns {
              + name = "pathologicaltnmfinding"
              + type = "string"
            }
          + columns {
              + name = "phenotypicfeatures"
              + type = "string"
            }
          + columns {
              + name = "sampleorigindetail"
              + type = "string"
            }
          + columns {
              + name = "sampleorigintype"
              + type = "string"
            }
          + columns {
              + name = "sampleprocessing"
              + type = "string"
            }
          + columns {
              + name = "samplestorage"
              + type = "string"
            }
          + columns {
              + name = "tumorgrade"
              + type = "string"
            }
          + columns {
              + name = "tumorprogression"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "notes"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-biosamples-cache will be created
  + resource "aws_glue_catalog_table" "sbeacon-biosamples-cache" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_biosamples_cache"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = "s3://gaspi-metadata-20250523065512230500000001/biosamples-cache"
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "individualid"
              + type = "string"
            }
          + columns {
              + name = "biosamplestatus"
              + type = "string"
            }
          + columns {
              + name = "collectiondate"
              + type = "string"
            }
          + columns {
              + name = "collectionmoment"
              + type = "string"
            }
          + columns {
              + name = "diagnosticmarkers"
              + type = "string"
            }
          + columns {
              + name = "histologicaldiagnosis"
              + type = "string"
            }
          + columns {
              + name = "measurements"
              + type = "string"
            }
          + columns {
              + name = "obtentionprocedure"
              + type = "string"
            }
          + columns {
              + name = "pathologicalstage"
              + type = "string"
            }
          + columns {
              + name = "pathologicaltnmfinding"
              + type = "string"
            }
          + columns {
              + name = "phenotypicfeatures"
              + type = "string"
            }
          + columns {
              + name = "sampleorigindetail"
              + type = "string"
            }
          + columns {
              + name = "sampleorigintype"
              + type = "string"
            }
          + columns {
              + name = "sampleprocessing"
              + type = "string"
            }
          + columns {
              + name = "samplestorage"
              + type = "string"
            }
          + columns {
              + name = "tumorgrade"
              + type = "string"
            }
          + columns {
              + name = "tumorprogression"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "notes"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-datasets will be created
  + resource "aws_glue_catalog_table" "sbeacon-datasets" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_datasets"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = "s3://gaspi-metadata-20250523065512230500000001/datasets"
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_assemblyid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "_datasetname"
              + type = "string"
            }
          + columns {
              + name = "_vcflocations"
              + type = "string"
            }
          + columns {
              + name = "_vcfchromosomemap"
              + type = "string"
            }
          + columns {
              + name = "createdatetime"
              + type = "string"
            }
          + columns {
              + name = "datauseconditions"
              + type = "string"
            }
          + columns {
              + name = "description"
              + type = "string"
            }
          + columns {
              + name = "externalurl"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "name"
              + type = "string"
            }
          + columns {
              + name = "updatedatetime"
              + type = "string"
            }
          + columns {
              + name = "version"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-datasets-cache will be created
  + resource "aws_glue_catalog_table" "sbeacon-datasets-cache" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_datasets_cache"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = "s3://gaspi-metadata-20250523065512230500000001/datasets-cache"
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_assemblyid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "_datasetname"
              + type = "string"
            }
          + columns {
              + name = "_vcflocations"
              + type = "string"
            }
          + columns {
              + name = "_vcfchromosomemap"
              + type = "string"
            }
          + columns {
              + name = "createdatetime"
              + type = "string"
            }
          + columns {
              + name = "datauseconditions"
              + type = "string"
            }
          + columns {
              + name = "description"
              + type = "string"
            }
          + columns {
              + name = "externalurl"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "name"
              + type = "string"
            }
          + columns {
              + name = "updatedatetime"
              + type = "string"
            }
          + columns {
              + name = "version"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-individuals will be created
  + resource "aws_glue_catalog_table" "sbeacon-individuals" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_individuals"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = "s3://gaspi-metadata-20250523065512230500000001/individuals"
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "diseases"
              + type = "string"
            }
          + columns {
              + name = "ethnicity"
              + type = "string"
            }
          + columns {
              + name = "exposures"
              + type = "string"
            }
          + columns {
              + name = "geographicorigin"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "interventionsorprocedures"
              + type = "string"
            }
          + columns {
              + name = "karyotypicsex"
              + type = "string"
            }
          + columns {
              + name = "measures"
              + type = "string"
            }
          + columns {
              + name = "pedigrees"
              + type = "string"
            }
          + columns {
              + name = "phenotypicfeatures"
              + type = "string"
            }
          + columns {
              + name = "sex"
              + type = "string"
            }
          + columns {
              + name = "treatments"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-individuals-cache will be created
  + resource "aws_glue_catalog_table" "sbeacon-individuals-cache" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_individuals_cache"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = "s3://gaspi-metadata-20250523065512230500000001/individuals-cache"
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "diseases"
              + type = "string"
            }
          + columns {
              + name = "ethnicity"
              + type = "string"
            }
          + columns {
              + name = "exposures"
              + type = "string"
            }
          + columns {
              + name = "geographicorigin"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "interventionsorprocedures"
              + type = "string"
            }
          + columns {
              + name = "karyotypicsex"
              + type = "string"
            }
          + columns {
              + name = "measures"
              + type = "string"
            }
          + columns {
              + name = "pedigrees"
              + type = "string"
            }
          + columns {
              + name = "phenotypicfeatures"
              + type = "string"
            }
          + columns {
              + name = "sex"
              + type = "string"
            }
          + columns {
              + name = "treatments"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-relations will be created
  + resource "aws_glue_catalog_table" "sbeacon-relations" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_relations"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = "s3://gaspi-metadata-20250523065512230500000001/relations"
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "datasetid"
              + type = "string"
            }
          + columns {
              + name = "individualid"
              + type = "string"
            }
          + columns {
              + name = "biosampleid"
              + type = "string"
            }
          + columns {
              + name = "runid"
              + type = "string"
            }
          + columns {
              + name = "analysisid"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-runs will be created
  + resource "aws_glue_catalog_table" "sbeacon-runs" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_runs"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = "s3://gaspi-metadata-20250523065512230500000001/runs"
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "biosampleid"
              + type = "string"
            }
          + columns {
              + name = "individualid"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "librarylayout"
              + type = "string"
            }
          + columns {
              + name = "libraryselection"
              + type = "string"
            }
          + columns {
              + name = "librarysource"
              + type = "string"
            }
          + columns {
              + name = "librarystrategy"
              + type = "string"
            }
          + columns {
              + name = "platform"
              + type = "string"
            }
          + columns {
              + name = "platformmodel"
              + type = "string"
            }
          + columns {
              + name = "rundate"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-runs-cache will be created
  + resource "aws_glue_catalog_table" "sbeacon-runs-cache" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_runs_cache"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = "s3://gaspi-metadata-20250523065512230500000001/runs-cache"
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "biosampleid"
              + type = "string"
            }
          + columns {
              + name = "individualid"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "librarylayout"
              + type = "string"
            }
          + columns {
              + name = "libraryselection"
              + type = "string"
            }
          + columns {
              + name = "librarysource"
              + type = "string"
            }
          + columns {
              + name = "librarystrategy"
              + type = "string"
            }
          + columns {
              + name = "platform"
              + type = "string"
            }
          + columns {
              + name = "platformmodel"
              + type = "string"
            }
          + columns {
              + name = "rundate"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-terms-cache will be created
  + resource "aws_glue_catalog_table" "sbeacon-terms-cache" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_terms_cache"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = "s3://gaspi-metadata-20250523065512230500000001/terms-cache"
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "kind"
              + type = "string"
            }
          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "term"
              + type = "string"
            }
          + columns {
              + name = "label"
              + type = "string"
            }
          + columns {
              + name = "type"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_crawler.sbeacon-crawler will be created
  + resource "aws_glue_crawler" "sbeacon-crawler" {
      + arn           = (known after apply)
      + configuration = jsonencode(
            {
              + CrawlerOutput = {
                  + Partitions = {
                      + AddOrUpdateBehavior = "InheritFromTable"
                    }
                }
              + Grouping      = {
                  + TableGroupingPolicy = "CombineCompatibleSchemas"
                }
              + Version       = 1
            }
        )
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon-crawler"
      + role          = (known after apply)
      + tags_all      = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }

      + catalog_target {
          + database_name = "sbeacon_metadata"
          + tables        = [
              + "sbeacon_individuals",
              + "sbeacon_biosamples",
            ]
        }

      + schema_change_policy {
          + delete_behavior = "LOG"
          + update_behavior = "UPDATE_IN_DATABASE"
        }
    }

  # module.sbeacon.aws_iam_instance_profile.ec2_deidentification_instance_profile will be created
  + resource "aws_iam_instance_profile" "ec2_deidentification_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "sbeacon_backend_ec2_deidentification_instance_profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "sbeacon_backend_ec2_deidentification_instance_role"
      + tags_all    = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id   = (known after apply)
    }

  # module.sbeacon.aws_iam_policy.extra-glue-policy will be created
  + resource "aws_iam_policy" "extra-glue-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Extra permissions"
      + id               = (known after apply)
      + name             = "extra-glue-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:ListAllMyBuckets",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                          + "s3:GetBucketAcl",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::gaspi-metadata-20250523065512230500000001/*",
                          + "arn:aws:s3:::gaspi-metadata-20250523065512230500000001",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.sbeacon.aws_iam_role.ec2_deidentification_instance_role will be created
  + resource "aws_iam_role" "ec2_deidentification_instance_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon_backend_ec2_deidentification_instance_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.aws_iam_role.glue_role will be created
  + resource "aws_iam_role" "glue_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "glue.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "glue_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.aws_iam_role.sagemaker_jupyter_instance_role will be created
  + resource "aws_iam_role" "sagemaker_jupyter_instance_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "sagemaker.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon_backend_sagemaker_jupyter_instance_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.aws_iam_role_policy.ec2_deidentification_policy will be created
  + resource "aws_iam_role_policy" "ec2_deidentification_policy" {
      + id          = (known after apply)
      + name        = "sbeacon_backend_ec2_deidentification_policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.sbeacon.aws_iam_role_policy_attachment.glue-extra-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "glue-extra-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "glue_role"
    }

  # module.sbeacon.aws_iam_role_policy_attachment.glue-service-role-attachment will be created
  + resource "aws_iam_role_policy_attachment" "glue-service-role-attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole"
      + role       = "glue_role"
    }

  # module.sbeacon.aws_lambda_permission.APIGetConfiguration will be created
  + resource "aws_lambda_permission" "APIGetConfiguration" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getConfiguration"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/configuration"
      + statement_id        = "AllowAPIGetConfigurationInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetEntryTypes will be created
  + resource "aws_lambda_permission" "APIGetEntryTypes" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getEntryTypes"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/entry_types"
      + statement_id        = "AllowAPIGetEntryTypesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetFilteringTerms will be created
  + resource "aws_lambda_permission" "APIGetFilteringTerms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getFilteringTerms"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/filtering_terms"
      + statement_id        = "AllowAPIGetFilteringTermsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetInfo will be created
  + resource "aws_lambda_permission" "APIGetInfo" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getInfo"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/info"
      + statement_id        = "AllowAPIGetInfoInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetProjects will be created
  + resource "aws_lambda_permission" "APIGetProjects" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getProjects"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/projects"
      + statement_id        = "AllowAPIGetProjectsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetinfo-root will be created
  + resource "aws_lambda_permission" "APIGetinfo-root" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getInfo"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/"
      + statement_id        = "AllowAPIGetinfoRootInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetmap will be created
  + resource "aws_lambda_permission" "APIGetmap" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getMap"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/map"
      + statement_id        = "AllowAPIGetMapInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIadmin_proxy will be created
  + resource "aws_lambda_permission" "APIadmin_proxy" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-admin"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/admin/*"
      + statement_id        = "AllowAPIadmin_proxyInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIanalyses will be created
  + resource "aws_lambda_permission" "APIanalyses" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getAnalyses"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/analyses"
      + statement_id        = "AllowAPIanalysesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIanalysesFilteringTerms will be created
  + resource "aws_lambda_permission" "APIanalysesFilteringTerms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getAnalyses"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/analyses/filtering_terms"
      + statement_id        = "AllowAPIanalysesFilteringTermsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIanalysesId will be created
  + resource "aws_lambda_permission" "APIanalysesId" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getAnalyses"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/analyses/*"
      + statement_id        = "AllowAPIanalysesIdInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIanalysesIdg_variants will be created
  + resource "aws_lambda_permission" "APIanalysesIdg_variants" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getAnalyses"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/analyses/*/g_variants"
      + statement_id        = "AllowAPIanalysesIdg_variantsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIbiosamples will be created
  + resource "aws_lambda_permission" "APIbiosamples" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getBiosamples"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/biosamples"
      + statement_id        = "AllowAPIbiosamplesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIbiosamplesFilteringTerms will be created
  + resource "aws_lambda_permission" "APIbiosamplesFilteringTerms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getBiosamples"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/biosamples/filtering_terms"
      + statement_id        = "AllowAPIbiosamplesFilteringTermsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIbiosamplesId will be created
  + resource "aws_lambda_permission" "APIbiosamplesId" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getBiosamples"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/biosamples/*"
      + statement_id        = "AllowAPIbiosamplesIdInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIbiosamplesIdanalyses will be created
  + resource "aws_lambda_permission" "APIbiosamplesIdanalyses" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getBiosamples"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/biosamples/*/analyses"
      + statement_id        = "AllowAPIbiosamplesIdanalysesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIbiosamplesIdg_variants will be created
  + resource "aws_lambda_permission" "APIbiosamplesIdg_variants" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getBiosamples"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/biosamples/*/g_variants"
      + statement_id        = "AllowAPIbiosamplesIdg_variantsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIbiosamplesIdruns will be created
  + resource "aws_lambda_permission" "APIbiosamplesIdruns" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getBiosamples"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/biosamples/*/runs"
      + statement_id        = "AllowAPIbiosamplesIdrunsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasets will be created
  + resource "aws_lambda_permission" "APIdatasets" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/datasets"
      + statement_id        = "AllowAPIdatasetsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasetsFilteringTerms will be created
  + resource "aws_lambda_permission" "APIdatasetsFilteringTerms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/datasets/filtering_terms"
      + statement_id        = "AllowAPIdatasetsFilteringTermsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasetsId will be created
  + resource "aws_lambda_permission" "APIdatasetsId" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/datasets/*"
      + statement_id        = "AllowAPIdatasetsIdInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasetsIdbiosamples will be created
  + resource "aws_lambda_permission" "APIdatasetsIdbiosamples" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/datasets/*/biosamples"
      + statement_id        = "AllowAPIdatasetsIdbiosamplesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasetsIdfiltering_terms will be created
  + resource "aws_lambda_permission" "APIdatasetsIdfiltering_terms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/datasets/*/filtering_terms"
      + statement_id        = "AllowAPIdatasetsIdfiltering_termsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasetsIdg_variants will be created
  + resource "aws_lambda_permission" "APIdatasetsIdg_variants" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/datasets/*/g_variants"
      + statement_id        = "AllowAPIdatasetsIdg_variantsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdatasetsIdindividuals will be created
  + resource "aws_lambda_permission" "APIdatasetsIdindividuals" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getDatasets"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/datasets/*/individuals"
      + statement_id        = "AllowAPIdatasetsIdindividualsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIdportal_proxy will be created
  + resource "aws_lambda_permission" "APIdportal_proxy" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-dataPortal"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/dportal/*"
      + statement_id        = "AllowAPIdportal_proxyInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIg_variants will be created
  + resource "aws_lambda_permission" "APIg_variants" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getGenomicVariants"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/g_variants"
      + statement_id        = "AllowAPIg_variantsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIg_variantsId will be created
  + resource "aws_lambda_permission" "APIg_variantsId" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getGenomicVariants"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/g_variants/*"
      + statement_id        = "AllowAPIg_variantsIdInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIg_variantsIdbiosamples will be created
  + resource "aws_lambda_permission" "APIg_variantsIdbiosamples" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getGenomicVariants"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/g_variants/*/biosamples"
      + statement_id        = "AllowAPIg_variantsIdbiosamplesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIg_variantsIdindividuals will be created
  + resource "aws_lambda_permission" "APIg_variantsIdindividuals" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getGenomicVariants"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/g_variants/*/individuals"
      + statement_id        = "AllowAPIg_variantsIdindividualsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIindividuals will be created
  + resource "aws_lambda_permission" "APIindividuals" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getIndividuals"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/individuals"
      + statement_id        = "AllowAPIindividualsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIindividualsFilteringTerms will be created
  + resource "aws_lambda_permission" "APIindividualsFilteringTerms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getIndividuals"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/individuals/filtering_terms"
      + statement_id        = "AllowAPIindividualsFilteringTermsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIindividualsId will be created
  + resource "aws_lambda_permission" "APIindividualsId" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getIndividuals"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/individuals/*"
      + statement_id        = "AllowAPIindividualsIdInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIindividualsIdbiosamples will be created
  + resource "aws_lambda_permission" "APIindividualsIdbiosamples" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getIndividuals"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/individuals/*/biosamples"
      + statement_id        = "AllowAPIindividualsIdbiosamplesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIindividualsIdg_variants will be created
  + resource "aws_lambda_permission" "APIindividualsIdg_variants" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getIndividuals"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/individuals/*/g_variants"
      + statement_id        = "AllowAPIindividualsIdg_variantsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIruns will be created
  + resource "aws_lambda_permission" "APIruns" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getRuns"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/runs"
      + statement_id        = "AllowAPIrunsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIrunsFilteringTerms will be created
  + resource "aws_lambda_permission" "APIrunsFilteringTerms" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getRuns"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/runs/filtering_terms"
      + statement_id        = "AllowAPIrunsFilteringTermsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIrunsId will be created
  + resource "aws_lambda_permission" "APIrunsId" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getRuns"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/runs/*"
      + statement_id        = "AllowAPIrunsIdInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIrunsIdanalyses will be created
  + resource "aws_lambda_permission" "APIrunsIdanalyses" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getRuns"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/runs/*/analyses"
      + statement_id        = "AllowAPIrunsIdanalysesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIrunsIdg_variants will be created
  + resource "aws_lambda_permission" "APIrunsIdg_variants" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getRuns"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:ap-southeast-3:438465168484:wfavief721/*/*/runs/*/g_variants"
      + statement_id        = "AllowAPIrunsIdg_variantsInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.S3deidentifyFiles will be created
  + resource "aws_lambda_permission" "S3deidentifyFiles" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_arn          = "arn:aws:s3:::gaspi-dataportal-20250523065512727900000003"
      + statement_id        = "SBeaconBackendAllowS3deidentifyFilesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.S3updateFiles will be created
  + resource "aws_lambda_permission" "S3updateFiles" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_arn          = "arn:aws:s3:::gaspi-dataportal-20250523065512727900000003"
      + statement_id        = "SBeaconBackendAllowS3updateFilesInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.SNSperformQuery will be created
  + resource "aws_lambda_permission" "SNSperformQuery" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SBeaconBackendAllowSNSperformQueryInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.SNSsplitQuery will be created
  + resource "aws_lambda_permission" "SNSsplitQuery" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SBeaconBackendAllowSNSsplitQueryInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_s3_bucket_notification.updateFiles will be created
  + resource "aws_s3_bucket_notification" "updateFiles" {
      + bucket      = "gaspi-dataportal-20250523065512727900000003"
      + eventbridge = false
      + id          = (known after apply)

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
              + "s3:ObjectRemoved:*",
            ]
          + filter_prefix       = "projects/"
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix       = "staging/projects/"
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
    }

  # module.sbeacon.aws_sagemaker_notebook_instance_lifecycle_configuration.sagemaker_jupyter_instance_lcc will be created
  + resource "aws_sagemaker_notebook_instance_lifecycle_configuration" "sagemaker_jupyter_instance_lcc" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "clone-gaspi-notebooks"
      + on_create = "IyEvYmluL2Jhc2gKCnN1ZG8gdW5saW5rIC9ob21lL2VjMi11c2VyL3NhbXBsZS1ub3RlYm9va3MKZ2l0IGNsb25lIC0tZGVwdGggMSBodHRwczovL2dpdGh1Yi5jb20vR1NJLVhhcGllbnMtQ1NJUk8vR0FTUEktRVRMLW5vdGVib29rcy5naXQgL2hvbWUvZWMyLXVzZXIvR0FTUEktRVRMLW5vdGVib29rcwpzdWRvIGxuIC1zIC9ob21lL2VjMi11c2VyL0dBU1BJLUVUTC1ub3RlYm9va3MgL2hvbWUvZWMyLXVzZXIvc2FtcGxlLW5vdGVib29rcwoK"
      + on_start  = "IyEvYmluL2Jhc2gKCnN1ZG8gdW5saW5rIC9ob21lL2VjMi11c2VyL3NhbXBsZS1ub3RlYm9va3MKZ2l0IGNsb25lIC0tZGVwdGggMSBodHRwczovL2dpdGh1Yi5jb20vR1NJLVhhcGllbnMtQ1NJUk8vR0FTUEktRVRMLW5vdGVib29rcy5naXQgL2hvbWUvZWMyLXVzZXIvR0FTUEktRVRMLW5vdGVib29rcwpzdWRvIGxuIC1zIC9ob21lL2VjMi11c2VyL0dBU1BJLUVUTC1ub3RlYm9va3MgL2hvbWUvZWMyLXVzZXIvc2FtcGxlLW5vdGVib29rcwoK"
      + tags_all  = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.sbeacon.aws_sns_topic.performQuery will be created
  + resource "aws_sns_topic" "performQuery" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "performQuery"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tracing_config              = (known after apply)
    }

  # module.sbeacon.aws_sns_topic.splitQuery will be created
  + resource "aws_sns_topic" "splitQuery" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "splitQuery"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tracing_config              = (known after apply)
    }

  # module.sbeacon.aws_sns_topic_subscription.performQuery will be created
  + resource "aws_sns_topic_subscription" "performQuery" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.sbeacon.aws_sns_topic_subscription.splitQuery will be created
  + resource "aws_sns_topic_subscription" "splitQuery" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after app
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.